# Используем официальный образ Python 3.11
FROM python:3.11-slim

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем requirements.txt и устанавливаем зависимости
COPY requirements.txt .
RUN pip install --no-cache-dir -r requirements.txt

# Копируем остальные файлы проекта
COPY . .

# Открываем порт 8000
EXPOSE 8000

# Запускаем сервер Django
CMD ["python", "manage.py", "runserver", "0.0.0.0:8000"]

#Документация: EXPOSE указывает, какие порты контейнер будет слушать. 
#Это полезно для документирования и понимания, 
#какие порты должны быть открыты для корректной работы контейнера.
#Инструменты: Некоторые инструменты и оркестраторы, такие как Docker Compose, 
#могут использовать информацию из EXPOSE для автоматической настройки сетевых правил.
